A3SDK/templates/init_payment_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tnt="http://www.a-3.ru/tnt/">
    <soapenv:Header/>
    <soapenv:Body>
        <tnt:initPaymentRequest>
            <systemID>{{ system_id }}</systemID>
            <paymentType>{{ payment_type }}</paymentType>
            <currency>{{ currency }}</currency>
            <amount>{{ amount }}</amount>
            <orderID>{{ order_id }}</orderID>
            {% if payment_type == 'ANDROIDPAY' or payment_type == 'APPLEPAY' %}
            <token>{{ token }}</token>
            {% endif %}
            {% if fee %}<fee>{{ fee }}</fee>{% endif %}
            {% if order_desc %}<orderDesc>{{ order_desc }}</orderDesc>{% endif %}
            {% if phone %}<phone>{{ phone }}</phone>{% endif %}
            {% if payment_type == 'CARD' %}
            <urlSuccess>{{ url_success }}</urlSuccess>
            <urlFail>{{ url_fail }}</urlFail>
            {% endif %}
        </tnt:initPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>